workspace/InformationRegisters/АукИсторияСтатусовАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИсторияСтатусовАукционов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукСтатусыАукционов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/Enums/АукСтатусыАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукСтатусыАукционов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодведениеПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйЭтап</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодведениеИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/InformationRegisters/АукИсторияСтатусовАукционов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(пСтруктураЗаписи) Экспорт
	
	сткРез = АукОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "АукИсторияСтатусовАукционов"); 
	
	Если Не сткРез.Успех Тогда	
		ВызватьИсключение сткРез.Ошибка;		
	КонецЕсли;
	
КонецПроцедуры

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат АукОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "АукИсторияСтатусовАукционов");
	
КонецФункции

Функция ТекущееСостояниеАукциона(пАукцион, пДата = Неопределено) Экспорт
	сткРезультат = Новый Структура("Статус, НомерЭтапа, Этап", ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПустаяСсылка"), 0, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Статус КАК Статус,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.НомерЭтапа КАК НомерЭтапа,
	|	Аук_ИсторияСтатусовАукционовСрезПоследних.Этап КАК Этап
	|ИЗ
	|	РегистрСведений.АукИсторияСтатусовАукционов.СрезПоследних(&НаДату, Аукцион = &Аукцион) КАК Аук_ИсторияСтатусовАукционовСрезПоследних";
	
	Запрос.УстановитьПараметр("Аукцион",	пАукцион);
	Запрос.УстановитьПараметр("НаДату",		пДата);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат сткРезультат;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(сткРезультат, Выборка);
		
		Возврат сткРезультат;
	КонецЕсли;	
КонецФункции

Функция ВремяОтказаОтПродолженияАукциона(пАукцион) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукИсторияСтатусовАукционов.Период КАК Период
	|ИЗ
	|	РегистрСведений.АукИсторияСтатусовАукционов КАК АукИсторияСтатусовАукционов
	|ГДЕ
	|	АукИсторияСтатусовАукционов.Аукцион = &Аукцион
	|	И АукИсторияСтатусовАукционов.Статус = Значение(Перечисление.АукСтатусыАукционов.Отменен)";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.Период;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;	
КонецФункции	

#КонецОбласти
